odriverobotics/ODrive/Firmware/STM32/stm32_tim.cpp

#include "stm32_tim.hpp"
#include "stm32_system.h"

bool STM32_Timer_t::get_source_freq(uint32_t* freq) {
    uint32_t dummy;
    if (!freq)
        freq = &dummy;

    if (htim.Instance == TIM1)
        *freq = HAL_RCC_GetPCLK2Freq();
    else if (htim.Instance == TIM2)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM3)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM4)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM5)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM6)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM7)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM8)
        *freq = HAL_RCC_GetPCLK2Freq();
    else if (htim.Instance == TIM9)
        *freq = HAL_RCC_GetPCLK2Freq();
    else if (htim.Instance == TIM10)
        *freq = HAL_RCC_GetPCLK2Freq();
    else if (htim.Instance == TIM11)
        *freq = HAL_RCC_GetPCLK2Freq();
    else if (htim.Instance == TIM12)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM13)
        *freq = HAL_RCC_GetPCLK1Freq();
    else if (htim.Instance == TIM14)
        *freq = HAL_RCC_GetPCLK1Freq();
    else
        return false;
    
    // All timers are fed by double their respective bus clock frequency
    // unless the bus clock uses a prescaler of 1 (which is not allowed on the STM32F405).
    *freq *= 2;
    return true;
}

bool STM32_Timer_t::init(uint32_t period, MODE mode, uint32_t prescaler, uint32_t repetition_counter) {
    if (htim.Instance == TIM1)
        __HAL_RCC_TIM1_CLK_ENABLE();
    else if (htim.Instance == TIM2)
        __HAL_RCC_TIM2_CLK_ENABLE();
    else if (htim.Instance == TIM3)
        __HAL_RCC_TIM3_CLK_ENABLE();
    else if (htim.Instance == TIM4)
        __HAL_RCC_TIM4_CLK_ENABLE();
    else if (htim.Instance == TIM5)
        __HAL_RCC_TIM5_CLK_ENABLE();
    else if (htim.Instance == TIM6)
        __HAL_RCC_TIM6_CLK_ENABLE();
    else if (htim.Instance == TIM7)
        __HAL_RCC_TIM7_CLK_ENABLE();
    else if (htim.Instance == TIM8)
        __HAL_RCC_TIM8_CLK_ENABLE();
    else if (htim.Instance == TIM9)
        __HAL_RCC_TIM9_CLK_ENABLE();
    else if (htim.Instance == TIM10)
        __HAL_RCC_TIM10_CLK_ENABLE();
    else if (htim.Instance == TIM11)
        __HAL_RCC_TIM11_CLK_ENABLE();
    else if (htim.Instance == TIM12)
        __HAL_RCC_TIM12_CLK_ENABLE();
    else if (htim.Instance == TIM13)
        __HAL_RCC_TIM13_CLK_ENABLE();
    else if (htim.Instance == TIM14)
        __HAL_RCC_TIM14_CLK_ENABLE();
    else
        return false;

    htim.Init.Prescaler = prescaler;
    switch (mode) {
        case UP: htim.Init.CounterMode = TIM_COUNTERMODE_UP; break;
        case DOWN: htim.Init.CounterMode = TIM_COUNTERMODE_DOWN; break;
        case UP_DOWN: htim.Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED3; break;
        default: return false;
    }
    htim.Init.Period = period;
    htim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim.Init.RepetitionCounter = repetition_counter;

    // The following section is basically a copy of HAL_TIM_Base_Init because,
    // dear STM, no I do NOT want an update event to be triggered in the middle
    // of the setup process.

    uint32_t tmpcr1 = 0U;
    tmpcr1 = htim.Instance->CR1;
    
    if (IS_TIM_CC3_INSTANCE(htim.Instance) != RESET) {
        tmpcr1 &= ~(TIM_CR1_DIR | TIM_CR1_CMS);
        tmpcr1 |= htim.Init.CounterMode;
    } else if (htim.Init.CounterMode != TIM_COUNTERMODE_UP) {
        return false;
    }
    
    if (IS_TIM_CC1_INSTANCE(htim.Instance) != RESET) {
        tmpcr1 &= ~TIM_CR1_CKD;
        tmpcr1 |= (uint32_t)htim.Init.ClockDivision;
    } else if (htim.Init.ClockDivision != 0) {
        return false;
    }

    htim.Instance->CR1 = tmpcr1;

    htim.Instance->ARR = (uint32_t)htim.Init.Period;
    htim.Instance->PSC = (uint32_t)htim.Init.Prescaler;

    if (IS_TIM_ADVANCED_INSTANCE(htim.Instance) != RESET) {
        htim.Instance->RCR = htim.Init.RepetitionCounter;
    } else if (htim.Init.RepetitionCounter != 0) {
        return false;
    }


    TIM_ClockConfigTypeDef sClockSourceConfig;
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim, &sClockSourceConfig) != HAL_OK)
        return false;

    TIM_MasterConfigTypeDef sMasterConfig;
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE; // tim1 and tim8 had this on TIM_TRGO_UPDATE
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim, &sMasterConfig) != HAL_OK)
        return false;

    // make sure TIMx_ARR is buffered (synchronized to update event)
    htim.Instance->CR1 |= TIM_CR1_ARPE;

    return true;
}

bool STM32_Timer_t::setup_pwm(uint32_t channel_num,
        STM32_GPIO_t* gpio_p, STM32_GPIO_t* gpio_n,
        bool active_high_p, bool active_high_n,
        uint32_t initial_val) {


    uint32_t channel_val = 0;
    if (channel_num == 1)
        channel_val = TIM_CHANNEL_1;
    else if (channel_num == 2)
        channel_val = TIM_CHANNEL_2;
    else if (channel_num == 3)
        channel_val = TIM_CHANNEL_3;
    else if (channel_num == 4)
        channel_val = TIM_CHANNEL_4;
    else
        return false;
  
    TIM_OC_InitTypeDef sConfigOC;
    sConfigOC.OCMode = TIM_OCMODE_PWM2;
    sConfigOC.Pulse = initial_val;
    sConfigOC.OCPolarity = active_high_p ? TIM_OCPOLARITY_HIGH : TIM_OCPOLARITY_LOW;
    sConfigOC.OCNPolarity = active_high_n ? TIM_OCNPOLARITY_HIGH : TIM_OCNPOLARITY_LOW;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    if (HAL_TIM_PWM_ConfigChannel(&htim, &sConfigOC, channel_val) != HAL_OK)
        return false;

    if (gpio_p)
        if (!gpio_p->setup_alternate_function(p_gpios[channel_num - 1], gpio_af, GPIO_t::NO_PULL, GPIO_t::SLOW))
            return false;

    if (gpio_n)
        if (!gpio_n->setup_alternate_function(n_gpios[channel_num - 1], gpio_af, GPIO_t::NO_PULL, GPIO_t::SLOW))
            return false;

