odriverobotics/ODrive/Firmware/STM32/stm32_tim.cpp
    return true;
}

bool STM32_Timer_t::set_freeze_on_dbg(bool freeze_on_dbg) {
    if (freeze_on_dbg) {
        if (htim.Instance == TIM1) {
            __HAL_DBGMCU_FREEZE_TIM1();
        } else if (htim.Instance == TIM2) {
            __HAL_DBGMCU_FREEZE_TIM2();
        } else if (htim.Instance == TIM3) {
            __HAL_DBGMCU_FREEZE_TIM3();
        } else if (htim.Instance == TIM4) {
            __HAL_DBGMCU_FREEZE_TIM4();
        } else if (htim.Instance == TIM5) {
            __HAL_DBGMCU_FREEZE_TIM5();
        } else if (htim.Instance == TIM6) {
            __HAL_DBGMCU_FREEZE_TIM6();
        } else if (htim.Instance == TIM7) {
            __HAL_DBGMCU_FREEZE_TIM7();
        } else if (htim.Instance == TIM8) {
            __HAL_DBGMCU_FREEZE_TIM8();
        } else if (htim.Instance == TIM9) {
            __HAL_DBGMCU_FREEZE_TIM9();
        } else if (htim.Instance == TIM10) {
            __HAL_DBGMCU_FREEZE_TIM10();
        } else if (htim.Instance == TIM11) {
            __HAL_DBGMCU_FREEZE_TIM11();
        } else if (htim.Instance == TIM12) {
            __HAL_DBGMCU_FREEZE_TIM12();
        } else if (htim.Instance == TIM13) {
            __HAL_DBGMCU_FREEZE_TIM13();
        } else if (htim.Instance == TIM14) {
            __HAL_DBGMCU_FREEZE_TIM14();
        } else {
            return false;
        }
    } else {
        if (htim.Instance == TIM1) {
            __HAL_DBGMCU_UNFREEZE_TIM1();
        } else if (htim.Instance == TIM2) {
            __HAL_DBGMCU_UNFREEZE_TIM2();
        } else if (htim.Instance == TIM3) {
            __HAL_DBGMCU_UNFREEZE_TIM3();
        } else if (htim.Instance == TIM4) {
            __HAL_DBGMCU_UNFREEZE_TIM4();
        } else if (htim.Instance == TIM5) {
            __HAL_DBGMCU_UNFREEZE_TIM5();
        } else if (htim.Instance == TIM6) {
            __HAL_DBGMCU_UNFREEZE_TIM6();
        } else if (htim.Instance == TIM7) {
            __HAL_DBGMCU_UNFREEZE_TIM7();
        } else if (htim.Instance == TIM8) {
            __HAL_DBGMCU_UNFREEZE_TIM8();
        } else if (htim.Instance == TIM9) {
            __HAL_DBGMCU_UNFREEZE_TIM9();
        } else if (htim.Instance == TIM10) {
            __HAL_DBGMCU_UNFREEZE_TIM10();
        } else if (htim.Instance == TIM11) {
            __HAL_DBGMCU_UNFREEZE_TIM11();
        } else if (htim.Instance == TIM12) {
            __HAL_DBGMCU_UNFREEZE_TIM12();
        } else if (htim.Instance == TIM13) {
            __HAL_DBGMCU_UNFREEZE_TIM13();
        } else if (htim.Instance == TIM14) {
            __HAL_DBGMCU_UNFREEZE_TIM14();
        } else {
            return false;
        }
    }
    return true;
}

static bool enable_ccx(TIM_TypeDef* instance, uint32_t channel_id) {
    if (IS_TIM_CCX_INSTANCE(instance, channel_id)) {
        /* Reset the CCxE Bit */
        instance->CCER &= ~(uint32_t)(TIM_CCER_CC1E << channel_id);
        /* Set or reset the CCxE Bit */ 
        instance->CCER |= (uint32_t)(TIM_CCx_ENABLE << channel_id);
        return true;
    } else {
        return false;
    }
}

static bool enable_ccxn(TIM_TypeDef* instance, uint32_t channel_id) {
    if (IS_TIM_CCXN_INSTANCE(instance, channel_id) && IS_TIM_COMPLEMENTARY_CHANNELS(channel_id)) {
        /* Reset the CCxNE Bit */
        instance->CCER &= ~(uint32_t)(TIM_CCER_CC1NE << channel_id);
        /* Set or reset the CCxNE Bit */ 
        instance->CCER |= (uint32_t)(TIM_CCxN_ENABLE << channel_id);
        return true;
    } else {
        return false;
    }
}

bool STM32_Timer_t::enable_pwm(bool ch1_p, bool ch1_n, bool ch2_p, bool ch2_n, bool ch3_p, bool ch3_n, bool ch4_p, bool ch4_n) {
    if (IS_TIM_ADVANCED_INSTANCE(htim.Instance)) {
        htim.Instance->BDTR &= ~TIM_BDTR_AOE; // ensure that MOE isn't re-enabled at the next update event
        __HAL_TIM_MOE_DISABLE_UNCONDITIONALLY(&htim);
    }

    if (ch1_p && !enable_ccx(htim.Instance, TIM_CHANNEL_1)) {
        return false;
    }
    if (ch1_n && !enable_ccxn(htim.Instance, TIM_CHANNEL_1)) {
        return false;
    }
    if (ch2_p && !enable_ccx(htim.Instance, TIM_CHANNEL_2)) {
        return false;
    }
    if (ch2_n && !enable_ccxn(htim.Instance, TIM_CHANNEL_2)) {
        return false;
    }
    if (ch3_p && !enable_ccx(htim.Instance, TIM_CHANNEL_3)) {
        return false;
    }
    if (ch3_n && !enable_ccxn(htim.Instance, TIM_CHANNEL_3)) {
        return false;
    }
    if (ch4_p && !enable_ccx(htim.Instance, TIM_CHANNEL_4)) {
        return false;
    }
    if (ch4_n && !enable_ccxn(htim.Instance, TIM_CHANNEL_4)) {
        return false;
    }

    __HAL_TIM_ENABLE(&htim);

    return true;
}

bool STM32_Timer_t::set_dead_time(uint32_t dead_time) {
    TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig;
    sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_ENABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_ENABLE;
    sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime = dead_time;
    sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
    sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
    if (HAL_TIMEx_ConfigBreakDeadTime(&htim, &sBreakDeadTimeConfig) != HAL_OK)
        return false;
    
    return true;
}

bool STM32_Timer_t::config_encoder_mode(STM32_GPIO_t* gpio_ch1, STM32_GPIO_t* gpio_ch2) {
    // TODO: make more flexible
    TIM_Encoder_InitTypeDef sConfig;
    sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
    sConfig.IC1Polarity = TIM_ICPOLARITY_RISING;
    sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
    sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
    sConfig.IC1Filter = 4;
    sConfig.IC2Polarity = TIM_ICPOLARITY_RISING;
    sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
    sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
    sConfig.IC2Filter = 4;
    if (HAL_TIM_Encoder_Init(&htim, &sConfig) != HAL_OK)
        return false;

    if (gpio_ch1)
        if (!gpio_ch1->setup_alternate_function(p_gpios[0], gpio_af, GPIO_t::NO_PULL, GPIO_t::SLOW))
            return false;

    if (gpio_ch2)
        if (!gpio_ch2->setup_alternate_function(p_gpios[1], gpio_af, GPIO_t::NO_PULL, GPIO_t::SLOW))
            return false;

