odriverobotics/ODrive/Firmware/STM32/stm32_tim.cpp
    return true;
}

bool STM32_Timer_t::config_input_capture_mode(STM32_GPIO_t* gpio_ch1, STM32_GPIO_t* gpio_ch2, STM32_GPIO_t* gpio_ch3, STM32_GPIO_t* gpio_ch4) {
    TIM_IC_InitTypeDef sConfigIC;
    sConfigIC.ICPolarity = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
    sConfigIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
    sConfigIC.ICPrescaler = TIM_ICPSC_DIV1;
    sConfigIC.ICFilter = 15;

    if (gpio_ch1) {
        if (HAL_TIM_IC_ConfigChannel(&htim, &sConfigIC, TIM_CHANNEL_1) != HAL_OK)
            return false;
        if (!gpio_ch1->setup_alternate_function(p_gpios[0], gpio_af, GPIO_t::PULL_DOWN, GPIO_t::SLOW))
            return false;
    }

    if (gpio_ch2) {
        if (HAL_TIM_IC_ConfigChannel(&htim, &sConfigIC, TIM_CHANNEL_2) != HAL_OK)
            return false;
        if (!gpio_ch2->setup_alternate_function(p_gpios[1], gpio_af, GPIO_t::PULL_DOWN, GPIO_t::SLOW))
            return false;
    }

    if (gpio_ch3) {
        if (HAL_TIM_IC_ConfigChannel(&htim, &sConfigIC, TIM_CHANNEL_3) != HAL_OK)
            return false;
        if (!gpio_ch3->setup_alternate_function(p_gpios[2], gpio_af, GPIO_t::PULL_DOWN, GPIO_t::SLOW))
            return false;
    }

    if (gpio_ch4) {
        if (HAL_TIM_IC_ConfigChannel(&htim, &sConfigIC, TIM_CHANNEL_4) != HAL_OK)
            return false;
        if (!gpio_ch4->setup_alternate_function(p_gpios[3], gpio_af, GPIO_t::PULL_DOWN, GPIO_t::SLOW))
            return false;
    }

    return true;
}

bool STM32_Timer_t::get_general_irqn(IRQn_Type* irqn) {
    // note that timer 1 and timer 8 don't have a general interrupt vector,
    // but rather several specific ones.
    if (!irqn) {
        return false;
    } else if (htim.Instance == TIM2) {
        return *irqn = TIM2_IRQn, true;
    } else if (htim.Instance == TIM3) {
        return *irqn = TIM3_IRQn, true;
    } else if (htim.Instance == TIM4) {
        return *irqn = TIM4_IRQn, true;
    } else if (htim.Instance == TIM5) {
        return *irqn = TIM5_IRQn, true;
    } else if (htim.Instance == TIM6) {
        return *irqn = TIM6_DAC_IRQn, true;
    } else if (htim.Instance == TIM7) {
        return *irqn = TIM7_IRQn, true;
    } else if (htim.Instance == TIM9) {
        return *irqn = TIM1_BRK_TIM9_IRQn, true;
    } else if (htim.Instance == TIM10) {
        return *irqn = TIM1_UP_TIM10_IRQn, true;
    } else if (htim.Instance == TIM11) {
        return *irqn = TIM1_TRG_COM_TIM11_IRQn, true;
    } else if (htim.Instance == TIM12) {
        return *irqn = TIM8_BRK_TIM12_IRQn, true;
    } else if (htim.Instance == TIM13) {
        return *irqn = TIM8_UP_TIM13_IRQn, true;
    } else if (htim.Instance == TIM14) {
        return *irqn = TIM8_TRG_COM_TIM14_IRQn, true;
    } else {
        return false;
    }
};

bool STM32_Timer_t::enable_update_interrupt(uint8_t priority) {
    IRQn_Type irqn;
    if (htim.Instance == TIM1) {
        irqn = TIM1_UP_TIM10_IRQn;
    } else if (htim.Instance == TIM8) {
        irqn = TIM8_UP_TIM13_IRQn;
    } else if (!get_general_irqn(&irqn)) {
        return false;
    }

    enable_interrupt(irqn, priority);

    __HAL_TIM_ENABLE_IT(&htim, TIM_IT_UPDATE);

    return true;
}

bool STM32_Timer_t::enable_trigger_interrupt(uint8_t priority) {
    IRQn_Type irqn;
    if (htim.Instance == TIM1) {
        irqn = TIM1_TRG_COM_TIM11_IRQn;
    } else if (htim.Instance == TIM8) {
        irqn = TIM8_TRG_COM_TIM14_IRQn;
    } else if (!get_general_irqn(&irqn)) {
        return false;
    }

    enable_interrupt(irqn, priority);

    return true;
}

bool STM32_Timer_t::enable_cc_interrupt(uint8_t priority) {
    IRQn_Type irqn;
    if (htim.Instance == TIM1) {
        irqn = TIM1_CC_IRQn;
    } else if (htim.Instance == TIM8) {
        irqn = TIM8_CC_IRQn;
    } else if (!get_general_irqn(&irqn)) {
        return false;
    }

    __HAL_TIM_ENABLE_IT(&htim, TIM_IT_CC1);
    __HAL_TIM_ENABLE_IT(&htim, TIM_IT_CC2);
    __HAL_TIM_ENABLE_IT(&htim, TIM_IT_CC3);
    __HAL_TIM_ENABLE_IT(&htim, TIM_IT_CC4);

    enable_interrupt(irqn, priority);

    return true;
}

bool STM32_Timer_t::enable_break_interrupt(uint8_t priority) {
    IRQn_Type irqn;
    if (htim.Instance == TIM1) {
        irqn = TIM1_BRK_TIM9_IRQn;
    } else if (htim.Instance == TIM8) {
        irqn = TIM8_BRK_TIM12_IRQn;
    } else if (!get_general_irqn(&irqn)) {
        return false;
    }

    enable_interrupt(irqn, priority);

    return true;
}

void STM32_Timer_t::handle_update_irq() {
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_UPDATE)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_UPDATE)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_UPDATE);
            on_update_.invoke();
        }
    }
}

void STM32_Timer_t::handle_trigger_irq() {
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_TRIGGER)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_TRIGGER)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_TRIGGER);
            on_trigger_.invoke();
        }
    }
}

void STM32_Timer_t::handle_cc_irq() {
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_CC1)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_CC1)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_CC1);
            on_cc_.invoke(1, htim.Instance->CCR1);
        }
    }
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_CC2)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_CC2)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_CC2);
            on_cc_.invoke(2, htim.Instance->CCR2);
        }
    }
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_CC3)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_CC3)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_CC3);
            on_cc_.invoke(3, htim.Instance->CCR3);
        }
    }
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_CC4)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_CC4)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_CC4);
            on_cc_.invoke(4, htim.Instance->CCR4);
        }
    }
}

void STM32_Timer_t::handle_break_irq() {
    if (__HAL_TIM_GET_FLAG(&htim, TIM_FLAG_BREAK)) {
        if (__HAL_TIM_GET_IT_SOURCE(&htim, TIM_IT_BREAK)) {
            __HAL_TIM_CLEAR_IT(&htim, TIM_IT_BREAK);
            on_break_.invoke();
        }
    }
}

void sync_timers(STM32_Timer_t* tim_a, STM32_Timer_t* tim_b,
                 uint16_t TIM_CLOCKSOURCE_ITRx, uint16_t count_offset,
                 STM32_Timer_t* tim_refbase) {
    // Store intial timer configs
    uint16_t MOE_store_a = tim_a->htim.Instance->BDTR & (TIM_BDTR_MOE);
    uint16_t MOE_store_b = tim_b->htim.Instance->BDTR & (TIM_BDTR_MOE);
    uint16_t CR2_store = tim_a->htim.Instance->CR2;
    uint16_t SMCR_store = tim_b->htim.Instance->SMCR;
    // Turn off output
    tim_a->htim.Instance->BDTR &= ~(TIM_BDTR_MOE);
    tim_b->htim.Instance->BDTR &= ~(TIM_BDTR_MOE);
    // Disable both timer counters
    tim_a->htim.Instance->CR1 &= ~TIM_CR1_CEN;
    tim_b->htim.Instance->CR1 &= ~TIM_CR1_CEN;
    // Set first timer to send TRGO on counter enable
    tim_a->htim.Instance->CR2 &= ~TIM_CR2_MMS;
    tim_a->htim.Instance->CR2 |= TIM_TRGO_ENABLE;
    // Set Trigger Source of second timer to the TRGO of the first timer
    tim_b->htim.Instance->SMCR &= ~TIM_SMCR_TS;
    tim_b->htim.Instance->SMCR |= TIM_CLOCKSOURCE_ITRx;
    // Set 2nd timer to start on trigger
    tim_b->htim.Instance->SMCR &= ~TIM_SMCR_SMS;
    tim_b->htim.Instance->SMCR |= TIM_SLAVEMODE_TRIGGER;
    // Dir bit is read only in center aligned mode, so we clear the mode for now
    uint16_t CMS_store_a = tim_a->htim.Instance->CR1 & TIM_CR1_CMS;
    uint16_t CMS_store_b = tim_b->htim.Instance->CR1 & TIM_CR1_CMS;
    tim_a->htim.Instance->CR1 &= ~TIM_CR1_CMS;
    tim_b->htim.Instance->CR1 &= ~TIM_CR1_CMS;
    // Set both timers to up-counting state
    tim_a->htim.Instance->CR1 &= ~TIM_CR1_DIR;
    tim_b->htim.Instance->CR1 &= ~TIM_CR1_DIR;
    // Restore center aligned mode
    tim_a->htim.Instance->CR1 |= CMS_store_a;
    tim_b->htim.Instance->CR1 |= CMS_store_b;
    // set counter offset
    tim_a->htim.Instance->CNT = count_offset;
    tim_b->htim.Instance->CNT = 0;
    // Set and start reference timebase timer (if used)
    if (tim_refbase) {
        tim_refbase->htim.Instance->CNT = count_offset;
        tim_refbase->htim.Instance->CR1 |= (TIM_CR1_CEN); // start
    }
    // Start Timer a
    tim_a->htim.Instance->CR1 |= (TIM_CR1_CEN);
    // Restore timer configs
    tim_a->htim.Instance->CR2 = CR2_store;
    tim_b->htim.Instance->SMCR = SMCR_store;
    // restore output
    tim_a->htim.Instance->BDTR |= MOE_store_a;
    tim_b->htim.Instance->BDTR |= MOE_store_b;
}


