odriverobotics/ODrive/Firmware/STM32/stm32_tim.cpp
/* Interrupt entrypoints -----------------------------------------------------*/

volatile uint32_t tim1_up_tim10_irq_ticks = 0;
volatile uint32_t tim8_up_tim13_irq_ticks = 0;

extern "C" {

/** @brief Entrypoint for the TIM1 update interrupt and TIM10 global interrupt. */
void TIM1_UP_TIM10_IRQHandler(void) {
    PerformanceCounter_t cnt(tim1_up_tim10_irq_ticks);
    tim1.handle_update_irq();
    tim10.handle_any_irq();
}

/** @brief Entrypoint for the TIM1 trigger and commutation interrupt and TIM11 global interrupt. */
void TIM1_TRG_COM_TIM11_IRQHandler(void) {
    tim1.handle_trigger_irq();
    tim11.handle_any_irq();
}

/** @brief Entrypoint for the TIM1 capture compare interrupt. */
void TIM1_CC_IRQHandler(void) {
    tim1.handle_cc_irq();
}

/** @brief Entrypoint for the TIM1 break interrupt and TIM9 global interrupt. */
void TIM1_BRK_TIM9_IRQHandler(void) {
    tim1.handle_break_irq();
    tim9.handle_any_irq();
}

/** @brief Entrypoint for the TIM8 update interrupt and TIM13 global interrupt. */
void TIM8_UP_TIM13_IRQHandler(void) {
    PerformanceCounter_t cnt(tim8_up_tim13_irq_ticks);
    tim8.handle_update_irq();
    tim13.handle_any_irq();
}

/** @brief Entrypoint for the TIM8 trigger and commutation interrupt and TIM14 global interrupt. */
void TIM8_TRG_COM_TIM14_IRQHandler(void) {
    tim8.handle_trigger_irq();
    tim14.handle_any_irq();
}

/** @brief Entrypoint for the TIM8 capture compare interrupt. */
void TIM8_CC_IRQHandler(void) {
    tim8.handle_cc_irq();
}

/** @brief Entrypoint for the TIM8 break interrupt and TIM12 global interrupt. */
void TIM8_BRK_TIM12_IRQHandler(void) {
    tim8.handle_break_irq();
    tim12.handle_any_irq();
}

/** @brief Entrypoint for the TIM2 global interrupt. */
void TIM2_IRQHandler(void) {
    tim2.handle_any_irq();
}

/** @brief Entrypoint for the TIM3 global interrupt. */
void TIM3_IRQHandler(void) {
    tim3.handle_any_irq();
}

/** @brief Entrypoint for the TIM4 global interrupt. */
void TIM4_IRQHandler(void) {
    tim4.handle_any_irq();
}

/** @brief Entrypoint for the TIM5 global interrupt. */
void TIM5_IRQHandler(void) {
    tim5.handle_any_irq();
}

/** @brief Entrypoint for the TIM6 global interrupt. */
void TIM6_DAC_IRQHandler(void) {
    tim6.handle_any_irq();
}

/** @brief Entrypoint for the TIM7 global interrupt. */
void TIM7_IRQHandler(void) {
    tim7.handle_any_irq();
}

}


/* Peripheral definitions ----------------------------------------------------*/

const STM32_GPIO_t* no_gpios[] = { nullptr };

const STM32_GPIO_t* tim1_ch1p_gpios[] = { &pa8, &pe9, nullptr };
const STM32_GPIO_t* tim1_ch2p_gpios[] = { &pa9, &pe11, nullptr };
const STM32_GPIO_t* tim1_ch3p_gpios[] = { &pa10, &pe13, nullptr };
const STM32_GPIO_t* tim1_ch4p_gpios[] = { &pa11, &pe14, nullptr };
const STM32_GPIO_t* tim1_ch1n_gpios[] = { &pa6, &pb13, &pe8, nullptr };
const STM32_GPIO_t* tim1_ch2n_gpios[] = { &pb0, &pb14, &pe10, nullptr };
const STM32_GPIO_t* tim1_ch3n_gpios[] = { &pb1, &pb15, &pe12, nullptr };
const STM32_GPIO_t* tim1_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim1_bkin_gpios[] = { &pa6, &pb12, &pe15, nullptr };
const STM32_GPIO_t* tim1_etr_gpios[] = { &pa12, &pe7, nullptr };

const STM32_GPIO_t* tim2_ch1p_gpios[] = { &pa0, &pa5, &pa15 };
const STM32_GPIO_t* tim2_ch2p_gpios[] = { &pa1, &pb3, nullptr };
const STM32_GPIO_t* tim2_ch3p_gpios[] = { &pa2, &pb10, nullptr };
const STM32_GPIO_t* tim2_ch4p_gpios[] = { &pa3, &pb11, nullptr };
const STM32_GPIO_t* tim2_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim2_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim2_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim2_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim2_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim2_etr_gpios[] = { &pa0, &pa5, nullptr };

const STM32_GPIO_t* tim3_ch1p_gpios[] = { &pa6, &pb4, &pc6, nullptr };
const STM32_GPIO_t* tim3_ch2p_gpios[] = { &pa7, &pb5, &pc7, nullptr };
const STM32_GPIO_t* tim3_ch3p_gpios[] = { &pb0, &pc8, nullptr };
const STM32_GPIO_t* tim3_ch4p_gpios[] = { &pb1, &pc9, nullptr };
const STM32_GPIO_t* tim3_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim3_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim3_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim3_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim3_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim3_etr_gpios[] = { &pd2, nullptr };

const STM32_GPIO_t* tim4_ch1p_gpios[] = { &pb6, &pd12, nullptr };
const STM32_GPIO_t* tim4_ch2p_gpios[] = { &pb7, &pd13, nullptr };
const STM32_GPIO_t* tim4_ch3p_gpios[] = { &pb8, &pd14, nullptr };
const STM32_GPIO_t* tim4_ch4p_gpios[] = { &pb9, &pd15, nullptr };
const STM32_GPIO_t* tim4_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim4_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim4_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim4_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim4_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim4_etr_gpios[] = { &pe0, nullptr };

const STM32_GPIO_t* tim5_ch1p_gpios[] = { &pa0, &ph10, nullptr };
const STM32_GPIO_t* tim5_ch2p_gpios[] = { &pa1, &ph11, nullptr };
const STM32_GPIO_t* tim5_ch3p_gpios[] = { &pa2, &ph12, nullptr };
const STM32_GPIO_t* tim5_ch4p_gpios[] = { &pa3, &pi0, nullptr };
const STM32_GPIO_t* tim5_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim5_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim5_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim5_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim5_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim5_etr_gpios[] = { nullptr };

const STM32_GPIO_t* tim8_ch1p_gpios[] = { &pc6, &pi5, nullptr };
const STM32_GPIO_t* tim8_ch2p_gpios[] = { &pc7, &pi6, nullptr };
const STM32_GPIO_t* tim8_ch3p_gpios[] = { &pc8, &pi7, nullptr };
const STM32_GPIO_t* tim8_ch4p_gpios[] = { &pc9, &pi2, nullptr };
const STM32_GPIO_t* tim8_ch1n_gpios[] = { &pa5, &pa7, &ph13, nullptr };
const STM32_GPIO_t* tim8_ch2n_gpios[] = { &pb0, &pb14, &ph14, nullptr };
const STM32_GPIO_t* tim8_ch3n_gpios[] = { &pb1, &pb15, &ph15, nullptr };
const STM32_GPIO_t* tim8_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim8_bkin_gpios[] = { &pa6, &pi4, nullptr };
const STM32_GPIO_t* tim8_etr_gpios[] = { &pa0, &pi3, nullptr };

const STM32_GPIO_t* tim9_ch1p_gpios[] = { &pa2, &pe5, nullptr };
const STM32_GPIO_t* tim9_ch2p_gpios[] = { &pa3, &pe6, nullptr };
const STM32_GPIO_t* tim9_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim9_etr_gpios[] = { nullptr };

const STM32_GPIO_t* tim10_ch1p_gpios[] = { &pb8, &pf6, nullptr };
const STM32_GPIO_t* tim10_ch2p_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim10_etr_gpios[] = { nullptr };

const STM32_GPIO_t* tim11_ch1p_gpios[] = { &pb9, &pf7, nullptr };
const STM32_GPIO_t* tim11_ch2p_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim11_etr_gpios[] = { nullptr };

const STM32_GPIO_t* tim12_ch1p_gpios[] = { &pb14, &ph6, nullptr };
const STM32_GPIO_t* tim12_ch2p_gpios[] = { &pb15, &ph9, nullptr };
const STM32_GPIO_t* tim12_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim12_etr_gpios[] = { nullptr };

