odriverobotics/ODrive/Firmware/STM32/stm32_tim.cpp
const STM32_GPIO_t* tim13_ch1p_gpios[] = { &pa6, &pf8, nullptr };
const STM32_GPIO_t* tim13_ch2p_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim13_etr_gpios[] = { nullptr };

const STM32_GPIO_t* tim14_ch1p_gpios[] = { &pa7, &pf9, nullptr };
const STM32_GPIO_t* tim14_ch2p_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch3p_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch4p_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch1n_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch2n_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch3n_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_ch4n_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_bkin_gpios[] = { nullptr };
const STM32_GPIO_t* tim14_etr_gpios[] = { nullptr };

STM32_Timer_t tim1(TIM1,
        tim1_ch1p_gpios, tim1_ch2p_gpios, tim1_ch3p_gpios, tim1_ch4p_gpios,
        tim1_ch1n_gpios, tim1_ch2n_gpios, tim1_ch3n_gpios, tim1_ch4n_gpios,
        GPIO_AF1_TIM1);

STM32_Timer_t tim2(TIM2,
        tim2_ch1p_gpios, tim2_ch2p_gpios, tim2_ch3p_gpios, tim2_ch4p_gpios,
        tim2_ch1n_gpios, tim2_ch2n_gpios, tim2_ch3n_gpios, tim2_ch4n_gpios,
        GPIO_AF1_TIM2);

STM32_Timer_t tim3(TIM3,
        tim3_ch1p_gpios, tim3_ch2p_gpios, tim3_ch3p_gpios, tim3_ch4p_gpios,
        tim3_ch1n_gpios, tim3_ch2n_gpios, tim3_ch3n_gpios, tim3_ch4n_gpios,
        GPIO_AF2_TIM3);

STM32_Timer_t tim4(TIM4,
        tim4_ch1p_gpios, tim4_ch2p_gpios, tim4_ch3p_gpios, tim4_ch4p_gpios,
        tim4_ch1n_gpios, tim4_ch2n_gpios, tim4_ch3n_gpios, tim4_ch4n_gpios,
        GPIO_AF2_TIM4);

STM32_Timer_t tim5(TIM5,
        tim5_ch1p_gpios, tim5_ch2p_gpios, tim5_ch3p_gpios, tim5_ch4p_gpios,
        tim5_ch1n_gpios, tim5_ch2n_gpios, tim5_ch3n_gpios, tim5_ch4n_gpios,
        GPIO_AF2_TIM5);

STM32_Timer_t tim6(TIM6,
        no_gpios, no_gpios, no_gpios, no_gpios,
        no_gpios, no_gpios, no_gpios, no_gpios,
        0);

STM32_Timer_t tim7(TIM7,
        no_gpios, no_gpios, no_gpios, no_gpios,
        no_gpios, no_gpios, no_gpios, no_gpios,
        0);

STM32_Timer_t tim8(TIM8,
        tim8_ch1p_gpios, tim8_ch2p_gpios, tim8_ch3p_gpios, tim8_ch4p_gpios,
        tim8_ch1n_gpios, tim8_ch2n_gpios, tim8_ch3n_gpios, tim8_ch4n_gpios,
        GPIO_AF3_TIM8);

STM32_Timer_t tim9(TIM9,
        tim9_ch1p_gpios, tim9_ch2p_gpios, tim9_ch3p_gpios, tim9_ch4p_gpios,
        tim9_ch1n_gpios, tim9_ch2n_gpios, tim9_ch3n_gpios, tim9_ch4n_gpios,
        GPIO_AF3_TIM9);

STM32_Timer_t tim10(TIM10,
        tim10_ch1p_gpios, tim10_ch2p_gpios, tim10_ch3p_gpios, tim10_ch4p_gpios,
        tim10_ch1n_gpios, tim10_ch2n_gpios, tim10_ch3n_gpios, tim10_ch4n_gpios,
        GPIO_AF3_TIM10);

STM32_Timer_t tim11(TIM11,
        tim11_ch1p_gpios, tim11_ch2p_gpios, tim11_ch3p_gpios, tim11_ch4p_gpios,
        tim11_ch1n_gpios, tim11_ch2n_gpios, tim11_ch3n_gpios, tim11_ch4n_gpios,
        GPIO_AF3_TIM11);

STM32_Timer_t tim12(TIM12,
        tim12_ch1p_gpios, tim12_ch2p_gpios, tim12_ch3p_gpios, tim12_ch4p_gpios,
        tim12_ch1n_gpios, tim12_ch2n_gpios, tim12_ch3n_gpios, tim12_ch4n_gpios,
        GPIO_AF9_TIM12);

STM32_Timer_t tim13(TIM13,
        tim13_ch1p_gpios, tim13_ch2p_gpios, tim13_ch3p_gpios, tim13_ch4p_gpios,
        tim13_ch1n_gpios, tim13_ch2n_gpios, tim13_ch3n_gpios, tim13_ch4n_gpios,
        GPIO_AF9_TIM13);

STM32_Timer_t tim14(TIM14,
        tim14_ch1p_gpios, tim14_ch2p_gpios, tim14_ch3p_gpios, tim14_ch4p_gpios,
        tim14_ch1n_gpios, tim14_ch2n_gpios, tim14_ch3n_gpios, tim14_ch4n_gpios,
        GPIO_AF9_TIM14);
